In [1]:
import numpy as np
import pandas as pd

In [2]:
csv_in = 'baseball_shop.csv'
df = pd.read_csv(csv_in, delimiter=',', skiprows=None, header=0)

print(df.shape)
print(df.info())
display(df.head())

(376, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 376 entries, 0 to 375
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ShopID   376 non-null    int64
 1   Pref     376 non-null    object
 2   Product  376 non-null    object
 3   Price    376 non-null    int64
 4   Amount   376 non-null    int64
dtypes: int64(3), object(2)
memory usage: 14.8+ KB
None

   ShopID      Pref  Product  Price  Amount
0      18  Kanagawa      BAT  13800      10
1      18  Kanagawa  UNIFORM  11800      12
2      18  Kanagawa    GLOVE  16700      10
3      18  Kanagawa    SHOES  12800      10
4      30   Ibaraki      BAT  13800       8

In [3]:
print(df['Pref'].value_counts())
print(df['Product'].value_counts())

Tokyo       68
Kanagawa    68
Chiba       64
Saitama     48
Ibaraki     48
Gunma       40
Tochigi     40
Name: Pref, dtype: int64
UNIFORM    94
SHOES      94
GLOVE      94
BAT        94
Name: Product, dtype: int64

In [4]:
print(len(df['ShopID'].value_counts()))
# or
#print(df['ShopID'].nunique())

94

In [5]:
df['Sales'] = df['Price']*df['Amount']
display(df.head())

   ShopID      Pref  Product  Price  Amount   Sales
0      18  Kanagawa      BAT  13800      10  138000
1      18  Kanagawa  UNIFORM  11800      12  141600
2      18  Kanagawa    GLOVE  16700      10  167000
3      18  Kanagawa    SHOES  12800      10  128000
4      30   Ibaraki      BAT  13800       8  110400

In [6]:
print(df['Sales'].sum())

37283200

In [9]:
df_pref = df.groupby('Pref').sum()
print(df_pref['Sales'])

Pref
Chiba       5343100
Gunma       4021000
Ibaraki     4513500
Kanagawa    5813100
Saitama     5276800
Tochigi     3296300
Tokyo       9019400
Name: Sales, dtype: int64

In [10]:
print(df_pref['Sales'].idxmin())

Tochigi

In [11]:
df_pref_product = df.pivot_table('Sales', index='Pref', columns='Product',
                                 aggfunc=np.sum)
display(df_pref_product)
print(df_pref_product.at['Chiba', 'UNIFORM'])

Product       BAT    GLOVE    SHOES  UNIFORM
Pref
Chiba      966000  1486300  1356800  1534000
Gunma      938400  1402800   960000   719800
Ibaraki   1090200  1152300  1126400  1144600
Kanagawa  1297200  1619900  1574400  1321600
Saitama   1228200  1503000  1318400  1227200
Tochigi    759000   718100   780800  1038400
Tokyo     2166600  2839000  2137600  1876200

1534000